[
    {
        "title": "Trump threatens with bombing attacks if Iran does not sign a nuclear deal",
        "translated_text": "Trump threatens with bombing attacks if Iran does not sign a nuclear deal\n\nUS President Donald Trump threatened Iran on Sunday with bombing attacks if the country does not reach an agreement with Washington on its nuclear program.\n\nTrump's first comments, since Iran rejected direct talks with the US last week, were made to NBC News, where he said that American and Iranian officials were in talks. He did not elaborate further on this.\n\n- If they do not reach an agreement, there will be bombings.\n- It will be bombings they have never seen before, Trump said in a phone interview with NBC News.\n\nTrump has previously - in a letter to Iran - urged the Tehran government to reach a new nuclear deal with the US.\n\nIran does not want to negotiate under threats\n\nIran responded last week to Donald Trump's letter, stating that its policy is not to engage in direct negotiations with the US as long as Washington's maximum pressure campaign and military threats continue.\n\nIn the NBC interview, Trump also threatened Iran with secondary tariffs, which target buyers of a country's goods. He signed a presidential decree last week authorizing such tariffs on buyers of Venezuelan oil.\n\n- We will probably give it a couple of weeks, and if we do not see progress, we will implement them. We will not implement them right now, Trump said last night Danish time to a group of journalists aboard Air Force One.\n\nTehran claims its nuclear program is solely for civilian energy purposes."
    },
    {
        "title": "No thanks to soda and chips: In Mexico, schools now risk fines for serving fast food",
        "translated_text": "No thanks to soda and chips: In Mexico, schools now risk fines for serving fast food\n\nThe ban is an attempt to combat obesity among Mexican children.\n\nWhen Mexican children return to school today, many will find that their schools have reduced or completely changed their food and snack options.\n\nOn Saturday, a ban on unhealthy processed food in the country's schools came into effect.\n\nHowever, it is only today, when the children return to school after the weekend, that it will be noticeable, according to AP.\n\nThe ban means that schools must phase out all food and drinks high in salt, sugar, calories, and fat - such as sugary fruit drinks, chili nuts, and chips.\n\nAt the same time, they are required to serve alternatives to junk food.\n\nThis ban was passed by the Mexican government, led by President Claudia Sheinbaum. The country's Ministry of Education also encourages parents to support the ban by providing healthy meals for their children.\n\nUNICEF has declared the 'obesity epidemic' an emergency\n\nThe government's decision to not just recommend but implement a concrete ban on sugar and fat in schools is part of an effort to tackle obesity among the country's children.\n\nThis is a significant problem in Mexico.\n\nIn a 2020 report, UNICEF stated that children in Mexico consume more junk food than anywhere else in Latin America. The organization classifies the nation's childhood obesity epidemic as an emergency.\n\nUNICEF highlights that childhood obesity affects children's development and increases the risk of diseases in adulthood.\n\nAccording to UNICEF and statistics from the World Obesity Federation, more than a third of the country's children are overweight.\n\nSchools that break the ban on unhealthy food could face a fine of up to approximately 37,000 Danish kroner.\n\nHowever, in a country with 255,000 schools, many of which lack water fountains and reliable electricity, enforcing the ban in the real world may prove challenging, notes AP."
    },
    {
        "title": "A little miracle: Woman found alive after 60 hours in collapsed building",
        "translated_text": "A little miracle: Woman found alive after 60 hours in collapsed building\n\nA Chinese rescue team found the woman in the ruins of the Great Wall Hotel in Mandalay, Myanmar. The hotel collapsed after the country was struck by a powerful earthquake on Friday morning.\n\nOn Sunday afternoon, a Chinese rescue team arrived in the city of Mandalay, Myanmar.\n\nTheir task was to search through the ruins of one of the city's large hotels, which had been destroyed by a powerful earthquake on Friday. After the earthquake, half of the hotel was left in ruins, and the ground floor was reduced to rubble.\n\nThe Chinese rescue team heard signs of life from the rubble and were able to talk to someone in the ruins before they began the rescue operation, according to AP.\n\nAfter a five-hour rescue operation, the team was able to pull the woman free from the rubble of the Great Wall Hotel, around 8:00 PM Danish time on Sunday.\n\nThe woman was found with stable vital signs.\n\nRace against time\n\nSeveral rescue teams - including China's search and rescue team, volunteers from Shenzhen City, China, and a team from Russia - are conducting joint operations on the ground in a race against time to save more lives during the critical 72-hour 'golden period' after a natural disaster like an earthquake.\n\nThe UN's disaster agency (UNDRR) emphasizes the importance of a rapid rescue effort within the first 72 hours, as this is the period when it is most likely to find survivors after a natural disaster like an earthquake.\n\nFriday's earthquake, with a magnitude of 7.7, had its epicenter 17.2 kilometers from the major city of Mandalay, which has a population of around 1.2 million people.\n\nThe latest report from the country's military junta indicates that more than 1,600 people have died, over 3,400 are reported injured, and around 300 are still missing."
    },
    {
        "title": "Trump to American TV station: 'I am very angry at Putin'",
        "translated_text": "Trump to American TV station: 'I am very angry at Putin'\n\nA round of golf with the Finnish president may have influenced Trump to make harsh remarks about the Russian president, according to a researcher.\n\nIt can be difficult to figure out who is in favor and who is out of favor with US President Donald Trump.\n\nMany were surprised when he lashed out at Ukraine's President Volodymyr Zelenskyy, accusing him of not being ready for peace in Ukraine. At the same time, Trump's stance toward Russian President Vladimir Putin became warmer and warmer.\n\nBut now there is something indicating that the sympathy has shifted.\n\nOn Sunday, Trump grabbed the phone and called NBC News journalist Kristen Welker to tell her that he was \"very angry\" and \"furious\" with Russia's President Vladimir Putin.\n\nThis was allegedly due to Putin's criticism of Zelenskyy, according to the journalist about the conversation. She also said that Trump had stated that he would impose up to 50 percent tariffs on Russian oil within a month if a ceasefire agreement in the war does not materialize.\n\n- If Russia and I cannot agree on stopping the bloodshed in Ukraine, and if I believe that Russia is to blame... I will impose secondary tariffs on oil, on all oil coming from Russia, Trump allegedly said.\n\nHowever, Trump said in the conversation about Putin that he has \"a really good relationship with him\" and that \"the anger goes away quickly... if he does the right thing.\"\n\nWhy now?\n\nThe conversation with the NBC News journalist did not come at a random time, according to senior researcher Flemming Splidsboel at the Danish Institute for International Studies (DIIS).\n\nThe day before, on Saturday, the president had hosted Finnish President Alexander Stubb for a round of golf and a lunch in Florida.\n\nAnd he may very well have had some influence, according to Splidsboel.\n\n- He is a very experienced and skilled politician, and maybe during these golf rounds, he was able to influence Trump a little, suggesting that Putin is deceiving him, so he needs to step up, he said.\n\nAccording to a press release from Finland's government, the visit was \"unofficial\" and included breakfast, a round of golf, and lunch.\n\nAfter the visit, Finnish President Stubb said the meeting had been about US-Finland relations and \"Russia's war of aggression against Ukraine.\"\n\nHowever, President Stubb also had time to throw out a concrete suggestion between golf holes.\n\nAfter the meeting, Stubb said he had suggested to Trump that he should have a ceasefire ready by April 20, marking three months since Trump's inauguration.\n\nA smart move, according to Flemming Splidsboel.\n\n- It's certainly something that appeals to Trump: the idea of marking it in this way.\n\nA big part of Trump's frustration is that he feels that ceasefire negotiations are moving too slowly, according to Splidsboel.\n\nTherefore, one can also imagine that Putin will be a little more cooperative after Trump's threats.\n\n- Putin will probably try to introduce something into the process that gives it some momentum, so it seems like it is moving again. Enough to satisfy Trump and for Trump to say that now he has gotten Putin on board, Flemming Splidsboel said.\n\nTrump has stated that he will speak with Putin later this week.\n\nAccording to Kremlin spokesman Dmitry Peskov, no phone call has been scheduled between the two, but it can \"be arranged quickly if necessary,\" he said, according to The Guardian."
    },
    {
        "title": "Prince Harry in new storm - now accused of harassment and bullying",
        "translated_text": "Prince Harry in new storm - now accused of harassment and bullying\n\nPrince Harry left his own charity organization last week due to disagreements with the chairperson of the board.\n\nSo, it's trouble again.\n\nPrince Harry's face is again on the front pages of British media after he has gotten into a bit of a storm with his own charity organization Sentebale, which works with HIV-affected children and youth in South Africa.\n\nThe Duke of Sussex left the organization together with its co-founder, Prince Seeiso of Lesotho, and all board members because they had lost confidence in the chairperson, Sophie Chandauka.\n\nShe refuses to step down, even though the entire board wants her to.\n\n- The board members acted in the best interest of the charity by asking the chairperson to step down, while also keeping the staff's well-being in mind, said the two founders in a joint statement.\n\nBut Sophie Chandauka claims that Prince Harry is playing the \"victim card.\"\n\nIn a TV interview with Sky News, she also accused him of harassment and bullying because he made his withdrawal public without informing her first.\n\nFurthermore, she claims to have filed a whistleblower report about abuse of power, bullying, sexism, and racism within the organization - and has also reported the now-resigned board to the Charity Commission of England, according to BBC.\n\nThe CEO of Sentebale, Carmel Gaillard, has made a less harsh statement, saying in an official statement from the organization that \"conflict can arise\" and that they openly acknowledge and reflect on this in order to move forward.\n\nThe authority overseeing charities in England and Wales says, according to BBC, that they are \"aware of concerns about the leadership\" in Sentebale and are investigating the accusations.\n\nHarry and Prince Seeiso have not commented directly on the accusations but say they are \"shocked\" to leave the organization and will share their own concerns about the leadership with the Charity Commission of England.\n\nParticularly bad case for Harry\n\nPrince Harry and his wife, Duchess Meghan, have been very unpopular in the media since they stepped down as senior members of the British royal family in 2020.\n\nThey did so after criticizing the institution, accusing it of racism and criticizing and suing part of the British press for invading their privacy.\n\nAlmost since then, both Harry and Meghan have stayed away from social media due to online hate.\n\nMeghan has gone so far as to describe herself as \"the most harassed person in the world,\" and when she announced her return to Instagram this year, it was with the comment section permanently turned off.\n\nBut this issue regarding Sentebale hurts Harry especially because he started the organization in memory of his mother and her work for children with HIV and AIDS, says DR's correspondent in the UK, Tinne Hjersing Knudsen.\n\nAnd once again, he cannot expect public support.\n\n- I don't think anyone in the royal family wants to come to their rescue after the way they have exposed everyone, she says.\n\n- You don't become popular by going out and defending them in the UK.\n\nThe couple, whom many love to hate\n\nHarry and Meghan's criticism of the media and the royal family emerged in an interview with American talk-show queen Oprah, a six-hour Netflix documentary, and a book in which Prince Harry reveals intimate details about royal life and even talks about fights with his older brother, William.\n\nSince then, it's almost become a sport to criticize the couple, according to Tinne Hjersing Knudsen.\n\n- For many people, they are a favorite target. They left the UK for the US, turned their backs on the royal family, and exposed them. Therefore, people enjoy it when things don't go their way, she says.\n\nDuchess Meghan has also recently been in the media spotlight for her new Netflix series, 'With Love, Meghan,' which has been called tone-deaf and worse.\n\nThere are also rumors that she may not even have been invited to one of Sentebale's charity events, but still showed up on stage to present a trophy - much to the irritation of Sophie Chandauka, because it \"ruined the choreography on stage,\" according to Sky News.\n\n- Many people think the couple is out of touch, difficult to deal with, and some divas living on another planet, says Tinne Hjersing Knudsen.\n\nCan they do anything right?\n\n- From a British perspective, the answer is probably no, she says.\n\n- No matter what they do, people will find a way to fit it into the image they already have of them."
    }
]